{
  "architectures": [
    "Gemma4ForConditionalGeneration"
  ],
  "audio_config": null,
  "audio_token_id": 258881,
  "boa_token_id": 256000,
  "boi_token_id": 255999,
  "dtype": "bfloat16",
  "eoa_token_id": 258883,
  "eoa_token_index": 258883,
  "eoi_token_id": 258882,
  "eos_token_id": [
    1,
    106
  ],
  "image_token_id": 258880,
  "initializer_range": 0.02,
  "model_type": "gemma4",
  "quantization_config": {
    "config_groups": {
      "group_0": {
        "format": "nvfp4-pack-quantized",
        "input_activations": {
          "actorder": null,
          "block_structure": null,
          "dynamic": "local",
          "group_size": 16,
          "num_bits": 4,
          "observer": "static_minmax",
          "observer_kwargs": {},
          "scale_dtype": "torch.float8_e4m3fn",
          "strategy": "tensor_group",
          "symmetric": true,
          "type": "float",
          "zp_dtype": null
        },
        "output_activations": null,
        "targets": [
          "Linear"
        ],
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": 16,
          "num_bits": 4,
          "observer": "memoryless_minmax",
          "observer_kwargs": {},
          "scale_dtype": "torch.float8_e4m3fn",
          "strategy": "tensor_group",
          "symmetric": true,
          "type": "float",
          "zp_dtype": null
        }
      }
    },
    "format": "nvfp4-pack-quantized",
    "global_compression_ratio": null,
    "ignore": [
      "model.language_model.layers.0.router.proj",
      "model.language_model.layers.1.router.proj",
      "model.language_model.layers.2.router.proj",
      "model.language_model.layers.3.router.proj",
      "model.language_model.layers.4.router.proj",
      "model.language_model.layers.5.router.proj",
      "model.language_model.layers.6.router.proj",
      "model.language_model.layers.7.router.proj",
      "model.language_model.layers.8.router.proj",
      "model.language_model.layers.9.router.proj",
      "model.language_model.layers.10.router.proj",
      "model.language_model.layers.11.router.proj",
      "model.language_model.layers.12.router.proj",
      "model.language_model.layers.13.router.proj",
      "model.language_model.layers.14.router.proj",
      "model.language_model.layers.15.router.proj",
      "model.language_model.layers.16.router.proj",
      "model.language_model.layers.17.router.proj",
      "model.language_model.layers.18.router.proj",
      "model.language_model.layers.19.router.proj",
      "model.language_model.layers.20.router.proj",
      "model.language_model.layers.21.router.proj",
      "model.language_model.layers.22.router.proj",
      "model.language_model.layers.23.router.proj",
      "model.language_model.layers.24.router.proj",
      "model.language_model.layers.25.router.proj",
      "model.language_model.layers.26.router.proj",
      "model.language_model.layers.27.router.proj",
      "model.language_model.layers.28.router.proj",
      "model.language_model.layers.29.router.proj",
      "model.vision_tower.patch_embedder.input_proj",
      "model.vision_tower.encoder.layers.0.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.0.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.0.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.0.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.0.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.0.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.0.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.1.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.1.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.1.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.1.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.2.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.2.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.2.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.2.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.3.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.3.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.3.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.3.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.4.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.4.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.4.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.4.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.5.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.5.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.5.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.5.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.6.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.6.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.6.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.6.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.7.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.7.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.7.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.7.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.8.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.8.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.8.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.8.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.9.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.9.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.9.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.9.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.10.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.10.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.10.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.10.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.11.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.11.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.11.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.11.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.12.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.12.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.12.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.12.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.13.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.13.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.13.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.13.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.14.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.14.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.14.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.14.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.15.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.15.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.15.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.15.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.16.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.16.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.16.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.16.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.16.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.16.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.16.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.17.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.17.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.17.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.17.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.17.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.17.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.17.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.18.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.18.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.18.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.18.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.18.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.18.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.18.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.19.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.19.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.19.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.19.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.19.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.19.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.19.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.20.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.20.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.20.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.20.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.20.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.20.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.20.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.21.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.21.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.21.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.21.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.21.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.21.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.21.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.22.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.22.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.22.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.22.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.22.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.22.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.22.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.23.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.23.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.23.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.23.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.23.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.23.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.23.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.24.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.24.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.24.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.24.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.24.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.24.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.24.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.25.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.25.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.25.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.25.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.25.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.25.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.25.mlp.down_proj.linear",
      "model.vision_tower.encoder.layers.26.self_attn.q_proj.linear",
      "model.vision_tower.encoder.layers.26.self_attn.k_proj.linear",
      "model.vision_tower.encoder.layers.26.self_attn.v_proj.linear",
      "model.vision_tower.encoder.layers.26.self_attn.o_proj.linear",
      "model.vision_tower.encoder.layers.26.mlp.gate_proj.linear",
      "model.vision_tower.encoder.layers.26.mlp.up_proj.linear",
      "model.vision_tower.encoder.layers.26.mlp.down_proj.linear",
      "model.embed_vision.embedding_projection",
      "lm_head"
    ],
    "kv_cache_scheme": null,
    "quant_method": "compressed-tensors",
    "quantization_status": "compressed",
    "sparsity_config": {},
    "transform_config": {},
    "version": "0.14.1.a20260326"
  },
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_k_eq_v": true,
    "bos_token_id": 2,
    "dtype": "bfloat16",
    "enable_moe_block": true,
    "eos_token_id": 1,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 512,
    "head_dim": 256,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 2816,
    "hidden_size_per_layer_input": 0,
    "initializer_range": 0.02,
    "intermediate_size": 2112,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 262144,
    "model_type": "gemma4_text",
    "moe_intermediate_size": 704,
    "num_attention_heads": 16,
    "num_experts": 128,
    "num_global_key_value_heads": 2,
    "num_hidden_layers": 30,
    "num_key_value_heads": 8,
    "num_kv_shared_layers": 0,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.25,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 1024,
    "tie_word_embeddings": true,
    "top_k_experts": 8,
    "use_bidirectional_attention": "vision",
    "use_cache": true,
    "use_double_wide_mlp": false,
    "vocab_size": 262144,
    "vocab_size_per_layer_input": 262144
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "video_token_id": 258884,
  "vision_config": {
    "_name_or_path": "",
    "architectures": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "chunk_size_feed_forward": 0,
    "default_output_length": 280,
    "dtype": "bfloat16",
    "global_head_dim": 72,
    "head_dim": 72,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4304,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "max_position_embeddings": 131072,
    "model_type": "gemma4_vision",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "num_key_value_heads": 16,
    "output_attentions": false,
    "output_hidden_states": false,
    "patch_size": 16,
    "pooling_kernel_size": 3,
    "position_embedding_size": 10240,
    "problem_type": null,
    "return_dict": true,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 100.0,
      "rope_type": "default"
    },
    "standardize": true,
    "use_clipped_linears": false
  },
  "vision_soft_tokens_per_image": 280
}