{
  "architectures": [
    "DFlashDraftModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "block_size": 16,
  "bos_token_id": 2,
  "dflash_config": {
    "mask_token_id": 4,
    "target_layer_ids": [
      1,
      6,
      11,
      17,
      22,
      27
    ]
  },
  "dtype": "bfloat16",
  "eos_token_id": 1,
  "final_logit_softcapping": 30.0,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2816,
  "initializer_range": 0.02,
  "intermediate_size": 5632,
  "layer_types": [
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 262144,
  "max_window_layers": 5,
  "model_type": "qwen3",
  "num_attention_heads": 32,
  "num_hidden_layers": 5,
  "num_key_value_heads": 8,
  "num_target_layers": 30,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "sliding_window": 2048,
  "tie_word_embeddings": false,
  "transformers_version": "5.6.0",
  "use_cache": true,
  "use_sliding_window": true,
  "vocab_size": 262144,
  "rope_theta": 1000000,
  "rope_scaling": null
}